# DocumentReloadLatestProgressChangedEventArgs Properties

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
DocumentReloadLatestProgressChangedEventArgs Properties
DocumentReloadLatestProgressChangedEventArgs Class See Also
---
The DocumentReloadLatestProgressChangedEventArgs type exposes the following members.
# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Cancellable | Indicates whether an event may be cancelled by an event delegate.  (Inherited from RevitAPIEventArgs.) |
| FinishedSize | The transferred data size, in bytes, since the last time this event was raised.  (Inherited from DataTransferProgressChangedEventArgs.) |
| IsMerging | Indicates if it is merging downloaded data. |
| IsValidObject | Specifies whether the .NET object represents a valid Revit entity.  (Inherited from RevitAPIEventArgs.) |
| Location | Full path of the central model which is to be operated.  (Inherited from WorksharedOperationProgressChangedEventArgs.) |
| ReloadLatestFinished | Indicates if current 'reload latest' progress is finished. |
| RetryTimes | The number of times Revit has tried to Reload Latest. Its value is '0' at the first time. |
| Speed | Speed(bytes/second) in this event.  (Inherited from DataTransferProgressChangedEventArgs.) |
| Status | Gets API event status, reflect current operation execution status.  (Inherited from WorksharedOperationProgressChangedEventArgs.) |
| TotalSize | Total expected data size to transfer, in bytes.  (Inherited from DataTransferProgressChangedEventArgs.) |
| TransferMode | Data transfer mode in this event.  (Inherited from DataTransferProgressChangedEventArgs.) |

# See Also
DocumentReloadLatestProgressChangedEventArgs Class
Autodesk.Revit.DB.Events Namespace